OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_gcm.c
// AES GCM - NIST CAVS 14.0 Decrypt with keysize 128 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_128_encrypt8) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 128 Encrypt message_len=0 ad_len=16 mac_len=16 nonce_len=12 valid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "bc3ab28150fd4cb731d5f48ed2784173",
    .p_ad                   = "53d2fc19963fc99a36a524e39cb68aa8",
    .p_nonce                = "40408445c203c647312b8f01",
    .p_mac                  = "3f04dbd2f49909f73044175041fd9eff"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 128 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_128_encrypt9) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 128 Encrypt message_len=16 ad_len=0 mac_len=16 nonce_len=12 valid 1",
    .p_plaintext            = "28286a321293253c3e0aa2704a278032",
    .p_ciphertext           = "5a3c1cf1985dbb8bed818036fdd5ab42",
    .p_key                  = "e98b72a9881a84ca6b76e0f43e68647a",
    .p_ad                   = "",
    .p_nonce                = "8b23299fde174053f3d652ba",
    .p_mac                  = "23c7ab0f952b7091cd324835043b5eb5"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 128 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_128_encrypt10) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 128 Encrypt message_len=16 ad_len=0 mac_len=16 nonce_len=12 valid 2",
    .p_plaintext            = "95695a5b12f2870b9cc5fdc8f218a97d",
    .p_ciphertext           = "47bb7e23f7bdfe05a8091ac90e4f8b2e",
    .p_key                  = "33240636cd3236165f1a553b773e728e",
    .p_ad                   = "",
    .p_nonce                = "17c4d61493ecdc8f31700b12",
    .p_mac                  = "b723c70e931d9785f40fd4ab1d612dc9"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 128 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_128_encrypt11) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 128 Encrypt message_len=16 ad_len=0 mac_len=16 nonce_len=12 invalid 1",
    .p_plaintext            = "95695a5b12f2870b9cc5fdc8f218a97d",
    .p_ciphertext           = "0216c899c88d6e32c958c7e553daa5bc",
    .p_key                  = "5164df856f1e9cac04a79b808dc5be39",
    .p_ad                   = "",
    .p_nonce                = "e76925d5355e0584ce871b2b",
    .p_mac                  = "a145319896329c96df291f64efbe0e3a"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 128 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_128_encrypt12) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 128 Encrypt message_len=16 ad_len=16 mac_len=16 nonce_len=12 valid 1",
    .p_plaintext            = "ecafe96c67a1646744f1c891f5e69427",
    .p_ciphertext           = "552ebe012e7bcf90fcef712f8344e8f1",
    .p_key                  = "816e39070410cf2184904da03ea5075a",
    .p_ad                   = "f2a30728ed874ee02983c294435d3c16",
    .p_nonce                = "32c367a3362613b27fc3e67e",
    .p_mac                  = "ecaae9fc68276a45ab0ca3cb9dd9539f"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 128 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_128_encrypt13) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 128 Encrypt message_len=16 ad_len=16 mac_len=16 nonce_len=12 invalid 1",
    .p_plaintext            = "ecafe96c67a1646744f1c891f5e69427",
    .p_ciphertext           = "1c785025e5a2678e4b29b29276e395bb",
    .p_key                  = "867fc5d5476d5008f0703d81e3622255",
    .p_ad                   = "261a9efd4f32bc3d07c115b4edcf8adf",
    .p_nonce                = "22945529dff947c3c9264df7",
    .p_mac                  = "87fdf1261846164a950c37a3f2eea17d"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 128 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_128_encrypt14) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 128 Encrypt message_len=16 ad_len=16 mac_len=16 nonce_len=12 valid 2",
    .p_plaintext            = "ec18a057c22d12373b5efe4d177eb068",
    .p_ciphertext           = "0128a239bb43c12885f9591386ecac0f",
    .p_key                  = "3d17f97bf1dae4268b6610dc90c70b28",
    .p_ad                   = "681a4feac147ee2d25e9191aaa4c8830",
    .p_nonce                = "ebcd88fc18d4c99d28524d41",
    .p_mac                  = "144def0210af9348f07afe27e65bdc7e"
};

