OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_gcm.c
// AES GCM - NIST CAVS 14.0 Decrypt with keysize 128 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_128_encrypt15) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 128 Encrypt message_len=16 ad_len=90 mac_len=13 nonce_len=128 valid 1",
    .p_plaintext            = "1a964bfebe3908831558699d740bc46f",
    .p_ciphertext           = "55895bbe1f3bc758463a4a9355ef453f",
    .p_key                  = "dc5a53d122399fdfb1e5cc2dfca8900b",
    .p_ad                   = "2b7288f435248dc03dc0f3a2d5c82451bc34c1e319f23ce779d228d150bc8a69e82fb5062aa218d2a7810b39d551227b03e2e954179eac955be7f0a5b213f3a9f262a24f75c7631af3761cfa34adca7d100b9b17ade5c3b19af5",
    .p_nonce                = "fac4d131bc09ffb642a3e19f633f58a7bbc61949cea0ada34ab89df13e0e1b9080f968195782f0f765170c46476bec7b4d062c9714e5bb9cd63e4586d74e4a624ea875ef955b7614323a3f75af979423b4a39140c3a5edcef9ec9a158853a3fee6774e59c9863e1befaee60e2148639db953f4ab3b63e450529b0fccb3d3d134",
    .p_mac                  = "c11a27542917f024c973500da2"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 128 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_128_encrypt16) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 128 Encrypt message_len=16 ad_len=90 mac_len=13 nonce_len=128 invalid 1",
    .p_plaintext            = "1a964bfebe3908831558699d740bc46f",
    .p_ciphertext           = "12559383ff63bfaf2863f612e3ee39bc",
    .p_key                  = "c40ee4fec74740982e2b07183b9b81bb",
    .p_ad                   = "3a00dfeb4b66254ce1294c0a18619ae98ab97dac1ba9f321b747979dba6594a5d6fd7d6cea0f7453e1abd65752b168e4c907e32b486396dcf4c2648d534b22e8e619cd390e370cfa7138ac967ff424f6e00fb887da79d6d96c53",
    .p_nonce                = "42c38dae820a700f91ec38ae901947074250f2d813286ed5ec6353f7cd84e1eaa4649e03cbfb2ea9604b05c3fdabf091681a1646b9cec137a2d46b31925ab6741cbd3cc02d1b623b142407472b73a85cf9feef076fea6a56965733f5b15712b97622d75bd818fd996cd1edb38ef1c5d0344169a165a87a5fb278f740ced141d9",
    .p_mac                  = "4412b1fdb1405c250fcfa8db40"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 128 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_128_encrypt17) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 128 Encrypt message_len=16 ad_len=90 mac_len=13 nonce_len=128 valid 2",
    .p_plaintext            = "f3e05222ea6133e1b867a53986e4b432",
    .p_ciphertext           = "5d5d86133086a689fed21cc37c856a6f",
    .p_key                  = "fef36ef7f9305ecbd990619f28b2b9b6",
    .p_ad                   = "5f4990dce32043db4143aa58aba99a3cfb745444cc1a282bcc47aa58cc7031b36fd25c7575ea585fffe09e60bdcb477381a35f3fa3ec09426f05c84136e24f9aeabe94f8117e8e2e9f7b3527877c0d9442587642c57c2be63415",
    .p_nonce                = "601ef18957f79ccf67cacfd801aaed57a66c7e666385aeb9456284c567c27e38190fe652d44e9affe538236f25939ab127418498f04feeca35b38fca44e3fd0b6f98b77425cc403e6edb9800cc5b343d6c01d9871cbc9a3b478447267aa5b6614ee8d25e141275c1f46f083ee93eaccb35040b22ceaed28f0f28cadb48d576a0",
    .p_mac                  = "bd273924ae7e3ef6aa3ee66dbf"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 128 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_128_decrypt0) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 128 Decrypt message_len=0 ad_len=0 mac_len=16 nonce_len=12 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "cf063a34d4a9a76c2c86787d3f96db71",
    .p_ad                   = "",
    .p_nonce                = "113b9785971864c83b01c787",
    .p_mac                  = "72ac8493e3a5228b5d130a69d2510e42"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 128 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_128_decrypt1) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 128 Decrypt message_len=0 ad_len=0 mac_len=16 nonce_len=12 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "a49a5e26a2f8cb63d05546c2a62f5343",
    .p_ad                   = "",
    .p_nonce                = "907763b19b9b4ab6bd4f0281",
    .p_mac                  = "a2be08210d8c470a8df6e8fbd79ec5cf"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 128 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_128_decrypt2) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 128 Decrypt message_len=0 ad_len=0 mac_len=16 nonce_len=12 valid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "2ad0bf5aeb47a0c1a98da3dfdab4fded",
    .p_ad                   = "",
    .p_nonce                = "25f1b6091ee7040fea4ba854",
    .p_mac                  = "d7963d240317653e01cf5abe5d0966ae"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 128 - Count 3
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_128_decrypt3) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_128_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 128 Decrypt message_len=0 ad_len=0 mac_len=4 nonce_len=12 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "d1cb603b886e9deb62cbf5182caaeb35",
    .p_ad                   = "",
    .p_nonce                = "cd23f90cfd17727ea0975ff2",
    .p_mac                  = "e319af65"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 128 - Count 4
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_128_decrypt4) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_128_info,

#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 128 Decrypt message_len=0 ad_len=0 mac_len=4 nonce_len=12 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "e626638a113c617077f5c4b2284921c5",
    .p_ad                   = "",
    .p_nonce                = "c4a8864b4c3385a78cb8759f",
    .p_mac                  = "039d51f8"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 128 - Count 5
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_128_decrypt5) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 128 Decrypt message_len=0 ad_len=0 mac_len=4 nonce_len=12 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "8f74a8b922fcf1a8eed7320df9f03fd6",
    .p_ad                   = "",
    .p_nonce                = "925ec6414e777062ac839f06",
    .p_mac                  = "bb0dc912"
};

