OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_gcm.c
// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_encrypt1) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 192 Encrypt message_len=0 ad_len=0 mac_len=16 nonce_len=12 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "f780e4089a6224b9db576b368149fc4f58e6c8f7061814e2",
    .p_ad                   = "",
    .p_nonce                = "ae84a7ac9f89a70c92d566ec",
    .p_mac                  = "cd65b48665146066b92b34b38ec3415e"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_encrypt2) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 192 Encrypt message_len=0 ad_len=0 mac_len=16 nonce_len=12 valid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "0ed9f074d53b9b71bb87d123c16d269728ad819d89bba91c",
    .p_ad                   = "",
    .p_nonce                = "8b4e5be3cef24b12640bd781",
    .p_mac                  = "258e9d80875b4a6f4b7216da0db35e47"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_encrypt3) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 192 Encrypt message_len=0 ad_len=0 mac_len=4 nonce_len=12 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4bc27da31f2ad93f1bf07a386c3e437d5d1d8e641a778396",
    .p_ad                   = "",
    .p_nonce                = "1e437ff8358fc7401bd935e2",
    .p_mac                  = "08967511"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_encrypt4) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 192 Encrypt message_len=0 ad_len=0 mac_len=4 nonce_len=12 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "3d673cb7f8f9b599cef3eb4956c319c939caccb627aea76e",
    .p_ad                   = "",
    .p_nonce                = "bfc4d6b4a20ce5f9193ee4f5",
    .p_mac                  = "a082171c"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_encrypt5) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 192 Encrypt message_len=0 ad_len=0 mac_len=4 nonce_len=12 invalid 3",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "f3d1cd3c9c112a3a3b3768c3b65db6b9345028679513c4df",
    .p_ad                   = "",
    .p_nonce                = "9a789d2c76b3d9d5731e8acf",
    .p_mac                  = "bbd39626"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_encrypt6) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 192 Encrypt message_len=0 ad_len=16 mac_len=16 nonce_len=12 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "aa921cb5a243ab08911f3289266b39dab133f5c420a6c5cd",
    .p_ad                   = "487443c7c14ce474cb3d291f257070a2",
    .p_nonce                = "8f73db68daeeed2d155fb1a0",
    .p_mac                  = "b12674fbeac6889a24948f2792e30a50"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_encrypt7) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 192 Encrypt message_len=0 ad_len=16 mac_len=16 nonce_len=12 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "0778c653b8318c16cbe96af79e6fb57a628bb0a5eb65addc",
    .p_ad                   = "303a3c3f74104252abcf89282521cb65",
    .p_nonce                = "d901bc5babba7958af15c8b8",
    .p_mac                  = "d599c2b12f4afa1aeebbdee4c9e3ccf8"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_encrypt8) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 192 Encrypt message_len=0 ad_len=16 mac_len=16 nonce_len=12 valid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "409e7a1f2dc87b887da6cd51fa66b3c439d6bb64eed4f58b",
    .p_ad                   = "7ca7f102db61be6777cfb3142c81df38",
    .p_nonce                = "2c3eac60c57a4db5343c9fe5",
    .p_mac                  = "c4d72c983924fcd886b6e076525b7104"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_encrypt9) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 192 Encrypt message_len=16 ad_len=0 mac_len=16 nonce_len=12 valid 1",
    .p_plaintext            = "99ae6f479b3004354ff18cd86c0b6efb",
    .p_ciphertext           = "132ae95bd359c44aaefa6348632cafbd",
    .p_key                  = "7a7c5b6a8a9ab5acae34a9f6e41f19a971f9c330023c0f0c",
    .p_ad                   = "",
    .p_nonce                = "aa4c38bf587f94f99fee77d5",
    .p_mac                  = "19d7c7d5809ad6648110f22f272e7d72"
};

