OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_gcm.c
// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_encrypt10) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 192 Encrypt message_len=16 ad_len=0 mac_len=16 nonce_len=12 valid 2",
    .p_plaintext            = "7d81b948515c975308086fa960f7cc9a",
    .p_ciphertext           = "6e3720e76b6b4bf567ce9ae57f4aac9f",
    .p_key                  = "2797751ef6dd828c794429543f8d690e9fe618139ac1510f",
    .p_ad                   = "",
    .p_nonce                = "d960f74be927580a2e9f57ef",
    .p_mac                  = "f277556fc0a94b4ea786465ca5146aa4"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_encrypt11) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 192 Encrypt message_len=16 ad_len=0 mac_len=16 nonce_len=12 valid 3",
    .p_plaintext            = "28aa46393e1b8b8784b035f35d1ea9fa",
    .p_ciphertext           = "2f3c56eeeb62b393c571d126177865e9",
    .p_key                  = "843ae0ef237636df82b0307fb9064ee12fdab5a98e838bd6",
    .p_ad                   = "",
    .p_nonce                = "1df141ca68757aef80e414ec",
    .p_mac                  = "0fa560a3474eb37895bebb990d5ebf14"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_encrypt12) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 192 Encrypt message_len=16 ad_len=16 mac_len=16 nonce_len=12 invalid 1",
    .p_plaintext            = "28aa46393e1b8b8784b035f35d1ea9fa",
    .p_ciphertext           = "ad475445f3eecb217387be44895254e1",
    .p_key                  = "f3167d3ea919d15bb5254717cc8b2a18da1e35950a872089",
    .p_ad                   = "cc67a35257f75e8816d0de5b83d321f0",
    .p_nonce                = "5583ee965e59308a902a0703",
    .p_mac                  = "f7e9cef0e7296bdb0b4305b0a8edf9ac"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_encrypt13) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 192 Encrypt message_len=16 ad_len=16 mac_len=16 nonce_len=12 invalid 2",
    .p_plaintext            = "28aa46393e1b8b8784b035f35d1ea9fa",
    .p_ciphertext           = "1d8a02f16a49117c4358380db3d6518d",
    .p_key                  = "1a4c7488415dd3ba950be4a3bcd1ca00cd004afa28c2e1ce",
    .p_ad                   = "fa0f64cb4ea0ce865aa4144e03ee0fd1",
    .p_nonce                = "c9de7004ac7f9ab4ece85998",
    .p_mac                  = "c6bd80d982cc9db923b06e18bc557401"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_encrypt14) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 192 Encrypt message_len=16 ad_len=16 mac_len=16 nonce_len=12 invalid 3",
    .p_plaintext            = "28aa46393e1b8b8784b035f35d1ea9fa",
    .p_ciphertext           = "8ce3218d510f2f73621935a9dea64d1e",
    .p_key                  = "85e0788c66431fd78ea4dbc188a380a74f2568252623e293",
    .p_ad                   = "c1cc58d09b4a1e354275478ee87673e9",
    .p_nonce                = "b067415cca095c907c4e7473",
    .p_mac                  = "d0bea06cf298f9e60a148715e587acb5"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_encrypt15) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 192 Encrypt message_len=16 ad_len=90 mac_len=13 nonce_len=128 valid 1",
    .p_plaintext            = "aaa7c2dab7d6157f66268d60b6a718c0",
    .p_ciphertext           = "5b25b7681904d78ff19dde920c97623b",
    .p_key                  = "f10357dde935755c762a96659886688a25bf5fd2ad71ac9b",
    .p_ad                   = "bf36dc030d5bd3abbf2999df74aa81c2769338603e9d29f5c6016b041937157eadf786666bc7c30f6db9bede08273768942a552692fce7e1ea5c17b3e7b86733adcea5f6711a143b1be9525bf3c8b355e316029fa787c32e52dc",
    .p_nonce                = "8bbd8715baf1025c029d1191ef59f29564ca8bde6cfb1c97aee754a7876205f31769c9f774ce697d11b9c2581aae1efdf17b5ad759d0f67e06687abb81eda51726e11de3e45a34d29b826a2c0fdc76a7f8180be72d602da9ec6bb186bd4c4e7c111cdf8a94b3a30473e3e2ce7c8055b9edf41386b09480b0efe61e8199a576ed",
    .p_mac                  = "0a951dc55d979a5615a9467bce"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_encrypt16) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 192 Encrypt message_len=16 ad_len=90 mac_len=13 nonce_len=128 invalid 1",
    .p_plaintext            = "aaa7c2dab7d6157f66268d60b6a718c0",
    .p_ciphertext           = "ae2e4c37a04ae37aade697cea78a26b2",
    .p_key                  = "fe06c336529fd8533a53cb79c0500e2a569fc8febd161b0f",
    .p_ad                   = "1ea558f79d06bed3bda5e03989dbaa583f27491a76cb9347f74b753e0c537df9736db3ab38bc9f80d78190b8fda0cf2d31c9d3678540e8685c136e6ebb08e4b0c3133b3b9732cb8ebbbfb0cbb780f3fc338c1ed338cd23537866",
    .p_nonce                = "13aa3a4cc62921bedc8936f7a8e80fa7ed89639f2729565e2f8076efda1a411bee8bb10802d30538574fd86bbd05183c98d10bdc0bdc80fe3c8617c69bd9c839bec88f81b6624543d8ead96c85106338e2898d60289e1f4ddf49dac2c3dc0c6032533b1d7afe81e8701c5a9d0ef8a2e5bca1bf82d332b22c7d4ef2110e803308",
    .p_mac                  = "c35d020bf4bcda7e972a81a253"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_encrypt17) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 192 Encrypt message_len=16 ad_len=90 mac_len=13 nonce_len=128 valid 2",
    .p_plaintext            = "b32ef00ee70256466b9cdc1fa5728907",
    .p_ciphertext           = "0f74951242b2693f853daf1dc6660230",
    .p_key                  = "e218693f9fe9ee77a9cf7a7ac4d44b8a4cd8ca4e33cfe6b8",
    .p_ad                   = "d3bebae709147dbee6d023d3c2efc4d50b544a624b9843f8e6a3d13e7366b36c89c50c202b43d1f3ef0d405b632cd3e3512f405dd339ce9b858bb721ae36e27cdda66c8163f37072fa84be152d1e96734c620f5228da2bc2403c",
    .p_nonce                = "6a8d1a8778445165d4ee8212f8a2f48063f5ae588f9029ebf8431b9efcb185035c97488ed8b7f0004b864028f76692f193f0c68f20d9b5e6306147db45913403ebd8f5a9cf0f342e540c77cbb27ae33e159a2acadcf06bd196852fcab6f7275061bf20f7648e0ad155ec4b5de75254275ddad8f2e05469a20195b799103c6435",
    .p_mac                  = "814e7e5595f8001801e482ed45"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_decrypt0) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 192 Decrypt message_len=0 ad_len=0 mac_len=16 nonce_len=12 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "0e5d6e68f82f32bea3f0b69498c1a31ef6d955cd3d27a2a8",
    .p_ad                   = "",
    .p_nonce                = "caf72ee1e62e1001e8cfbc63",
    .p_mac                  = "db1a74ffb5f7de26f5742e0942b1b9cb"
};

