OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_gcm.c
// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_decrypt10) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 192 Decrypt message_len=16 ad_len=0 mac_len=16 nonce_len=12 valid 2",
    .p_plaintext            = "7d81b948515c975308086fa960f7cc9a",
    .p_ciphertext           = "6e3720e76b6b4bf567ce9ae57f4aac9f",
    .p_key                  = "2797751ef6dd828c794429543f8d690e9fe618139ac1510f",
    .p_ad                   = "",
    .p_nonce                = "d960f74be927580a2e9f57ef",
    .p_mac                  = "f277556fc0a94b4ea786465ca5146aa4"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_decrypt11) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 192 Decrypt message_len=16 ad_len=0 mac_len=16 nonce_len=12 valid 3",
    .p_plaintext            = "28aa46393e1b8b8784b035f35d1ea9fa",
    .p_ciphertext           = "2f3c56eeeb62b393c571d126177865e9",
    .p_key                  = "843ae0ef237636df82b0307fb9064ee12fdab5a98e838bd6",
    .p_ad                   = "",
    .p_nonce                = "1df141ca68757aef80e414ec",
    .p_mac                  = "0fa560a3474eb37895bebb990d5ebf14"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_decrypt12) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 192 Decrypt message_len=16 ad_len=16 mac_len=16 nonce_len=12 invalid 1",
    .p_plaintext            = "28aa46393e1b8b8784b035f35d1ea9fa",
    .p_ciphertext           = "ad475445f3eecb217387be44895254e1",
    .p_key                  = "f3167d3ea919d15bb5254717cc8b2a18da1e35950a872089",
    .p_ad                   = "cc67a35257f75e8816d0de5b83d321f0",
    .p_nonce                = "5583ee965e59308a902a0703",
    .p_mac                  = "f7e9cef0e7296bdb0b4305b0a8edf9ac"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_decrypt13) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 192 Decrypt message_len=16 ad_len=16 mac_len=16 nonce_len=12 invalid 2",
    .p_plaintext            = "28aa46393e1b8b8784b035f35d1ea9fa",
    .p_ciphertext           = "1d8a02f16a49117c4358380db3d6518d",
    .p_key                  = "1a4c7488415dd3ba950be4a3bcd1ca00cd004afa28c2e1ce",
    .p_ad                   = "fa0f64cb4ea0ce865aa4144e03ee0fd1",
    .p_nonce                = "c9de7004ac7f9ab4ece85998",
    .p_mac                  = "c6bd80d982cc9db923b06e18bc557401"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_decrypt14) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 192 Decrypt message_len=16 ad_len=16 mac_len=16 nonce_len=12 invalid 3",
    .p_plaintext            = "28aa46393e1b8b8784b035f35d1ea9fa",
    .p_ciphertext           = "8ce3218d510f2f73621935a9dea64d1e",
    .p_key                  = "85e0788c66431fd78ea4dbc188a380a74f2568252623e293",
    .p_ad                   = "c1cc58d09b4a1e354275478ee87673e9",
    .p_nonce                = "b067415cca095c907c4e7473",
    .p_mac                  = "d0bea06cf298f9e60a148715e587acb5"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 192 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_192_decrypt15) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_192_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 192 Decrypt message_len=16 ad_len=90 mac_len=13 nonce_len=128 valid 1",
    .p_plaintext            = "aaa7c2dab7d6157f66268d60b6a718c0",
    .p_ciphertext           = "5b25b7681904d78ff19dde920c97623b",
    .p_key                  = "f10357dde935755c762a96659886688a25bf5fd2ad71ac9b",
    .p_ad                   = "bf36dc030d5bd3abbf2999df74aa81c2769338603e9d29f5c6016b041937157eadf786666bc7c30f6db9bede08273768942a552692fce7e1ea5c17b3e7b86733adcea5f6711a143b1be9525bf3c8b355e316029fa787c32e52dc",
    .p_nonce                = "8bbd8715baf1025c029d1191ef59f29564ca8bde6cfb1c97aee754a7876205f31769c9f774ce697d11b9c2581aae1efdf17b5ad759d0f67e06687abb81eda51726e11de3e45a34d29b826a2c0fdc76a7f8180be72d602da9ec6bb186bd4c4e7c111cdf8a94b3a30473e3e2ce7c8055b9edf41386b09480b0efe61e8199a576ed",
    .p_mac                  = "0a951dc55d979a5615a9467bce"
};

