OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_gcm.c
// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_encrypt12) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 256 Encrypt message_len=16 ad_len=16 mac_len=16 nonce_len=12 valid 1",
    .p_plaintext            = "85fc3dfad9b5a8d3258e4fc44571bd3b",
    .p_ciphertext           = "426e0efc693b7be1f3018db7ddbb7e4d",
    .p_key                  = "54e352ea1d84bfe64a1011096111fbe7668ad2203d902a01458c3bbd85bfce14",
    .p_ad                   = "7e968d71b50c1f11fd001f3fef49d045",
    .p_nonce                = "df7c3bca00396d0c018495d9",
    .p_mac                  = "ee8257795be6a1164d7e1d2d6cac77a7"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_encrypt13) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 256 Encrypt message_len=16 ad_len=16 mac_len=16 nonce_len=12 valid 2",
    .p_plaintext            = "3fe7811a8224a1881da34a27e03da86a",
    .p_ciphertext           = "c61155d41495e9fc76060fe7f8c926a2",
    .p_key                  = "82f0d1ddc58123f805541f55a7eab43f56ddfefc06c73d57709df3d5a4aabfb3",
    .p_ad                   = "34325620a392739beeee6c370967d539",
    .p_nonce                = "0c9d74af29ed4406c77a8e4b",
    .p_mac                  = "66d8c881d66370504d2bf00cdb06259e"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_encrypt14) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 256 Encrypt message_len=16 ad_len=16 mac_len=16 nonce_len=12 invalid 1",
    .p_plaintext            = "3fe7811a8224a1881da34a27e03da86a",
    .p_ciphertext           = "e93165935ac18e3a2845d15fe31a9286",
    .p_key                  = "9a0343f850a6427120f764789ffec6d237447b898fbf51d2182f065d3861497d",
    .p_ad                   = "dbb8226a624520863db6897017b2a4f8",
    .p_nonce                = "3deef6f453dd70d92143adcd",
    .p_mac                  = "f5fc50d18766bc3d9e16dd136d45816b"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_encrypt15) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 256 Encrypt message_len=16 ad_len=90 mac_len=13 nonce_len=128 invalid 1",
    .p_plaintext            = "3fe7811a8224a1881da34a27e03da86a",
    .p_ciphertext           = "2975341596f99a22f85a48272d089357",
    .p_key                  = "f65818c25506e571ea4778e71b838ab24d3d6a318670885ded4761c2214ae08c",
    .p_ad                   = "f16c6a6a94a09f7936c718ca182f0e2d8b90de8edecec7257354a02539bee9d232c04b25d6fcc081e8852d834b7044cfec8b0073c62fc676b6d062693b99e791ddc6292bee1f5dc39acc18b06bf5c73a64772195b89659b87275",
    .p_nonce                = "f3d6c665c371db5c8d69ab46ac53eabfd4481a337d005bd0204f5838d770a1bb9868082542b43732d371c7786ab5e3fa217176f959ede631e373488c996c03c00496ff468cc9a2a15700e3aef82ae01f598f703e55da6d6cc9cace3c1f2adf6973af9f7f19dd903d7d0670bc082ec0e97c244426910b6c8e85358eaea8a9807b",
    .p_mac                  = "f260536b28c1220940044c3593"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_encrypt16) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 256 Encrypt message_len=16 ad_len=90 mac_len=13 nonce_len=128 valid 1",
    .p_plaintext            = "32f7cc94968659f34f23bda8117f065e",
    .p_ciphertext           = "8700601301096fbfe50b413a8059202d",
    .p_key                  = "fb9cf2d324f5ca351b37d960f314d602d33c01b21be3fcbe0e5a3c55eb9f7d74",
    .p_ad                   = "b0b6f49d881e0af5d879219d7acdd8efd7c2561ee5516de0cc32b61d1c8abd9629bfed1bfdd3cb73e3b39d480af6ea7f9c823f55512a8013ac92b6f3b13efe707dd08c4349e6e15bb2fd6ea4cd6de69b8f1b1c290353ea6ec548",
    .p_nonce                = "53571073c7deffe06b42e3a5cd0d0574ff9ba8afb2fa504420d5fbb1fc6c6aec70b412d40e4e0e0c0abccda8830d3aa6dcb14514f1648b13920a1cf0bc0dfc7ef26d9304f8c1a2858c5ae18993120508ead1f6aa1f7f5ed3f470b203045e9d3d97b493c7d6991061d62555c90bdbd46fa5fe40a4e762361c951f05ee3ce4dd1a",
    .p_mac                  = "247b1c2705c6300785ff514d58"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_encrypt17) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "GCM 256 Encrypt message_len=16 ad_len=90 mac_len=13 nonce_len=128 invalid 2",
    .p_plaintext            = "32f7cc94968659f34f23bda8117f065e",
    .p_ciphertext           = "5bfb289d9832cc5dffce4d1d33357951",
    .p_key                  = "b21ef6860b889efdc04ee1cbae0e84a4f31ac9369b01caa901e873ee6f970839",
    .p_ad                   = "d721291424b17f9ca4f059f208dd7908cdcfd50681641c8dfca185c89e7f1ecf1761bc32b492d8e5ce9cd873cd18a778595fd9b53878634b285f5383a79e01abf6542abffbf4f67347193740f73c3dbac654398027315280e2d5",
    .p_nonce                = "7657f649159a91a7f953e323c236a62f678dab54dd5ae8381419fbcb0ce3d3ec358d46fba5e4dc67cf4157bc6a8f42bc4b1d8624c0b9501f00146e628cecc6580aff6d1bf59f5667f3005b2636f4333930b07f8e814966fce1740919d1f3befa418a81693c0be066b1d17ede09ef36b35b1d908608aeb7ea77d03eec9936736b",
    .p_mac                  = "8eac04b744d91e7b2c5a6ed792"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_decrypt0) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 256 Decrypt message_len=0 ad_len=0 mac_len=16 nonce_len=12 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "f5a2b27c74355872eb3ef6c5feafaa740e6ae990d9d48c3bd9bb8235e589f010",
    .p_ad                   = "",
    .p_nonce                = "58d2240f580a31c1d24948e9",
    .p_mac                  = "15e051a5e4a5f5da6cea92e2ebee5bac"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_decrypt1) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 256 Decrypt message_len=0 ad_len=0 mac_len=16 nonce_len=12 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "e5a8123f2e2e007d4e379ba114a2fb66e6613f57c72d4e4f024964053028a831",
    .p_ad                   = "",
    .p_nonce                = "51e43385bf533e168427e1ad",
    .p_mac                  = "38fe845c66e66bdd884c2aecafd280e6"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_decrypt2) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 256 Decrypt message_len=0 ad_len=0 mac_len=16 nonce_len=12 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "c5ba3bf9ada560fb0301cd4e0b8b8a46a2aff2400395a72ed5804b3c755c4e59",
    .p_ad                   = "",
    .p_nonce                = "de2b956e704063c000f28bbb",
    .p_mac                  = "04eb9b20fd4548dc71594f20073a45a2"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_decrypt3) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 256 Decrypt message_len=0 ad_len=0 mac_len=4 nonce_len=12 invalid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "5765ad16f4dbd4d4e6370dbfa18b8ef5ac37459e39556afaba9b553dea4c1b23",
    .p_ad                   = "",
    .p_nonce                = "59678f262588e4d526d9fc34",
    .p_mac                  = "a68f33ed"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_decrypt4) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 256 Decrypt message_len=0 ad_len=0 mac_len=4 nonce_len=12 invalid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "a29fa93614e9f714c73d3707d1142b2514fa8a14641f79ef14e9bf0e812f49fa",
    .p_ad                   = "",
    .p_nonce                = "68272acf71b1cdad4655dbdc",
    .p_mac                  = "b90e554a"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_decrypt5) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 256 Decrypt message_len=0 ad_len=0 mac_len=4 nonce_len=12 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "717d2a5396ae21560a895a7847f53c47956d155ca4dd2165137d3506ff48a7bf",
    .p_ad                   = "",
    .p_nonce                = "6ccd8086830f586fa3b0e777",
    .p_mac                  = "a618ac6a"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_decrypt6) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 256 Decrypt message_len=0 ad_len=16 mac_len=16 nonce_len=12 valid 1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "6dfdafd6703c285c01f14fd10a6012862b2af950d4733abb403b2e745b26945d",
    .p_ad                   = "c0d249871992e70302ae008193d1e89f",
    .p_nonce                = "3749d0b3d5bacb71be06ade6",
    .p_mac                  = "4aa4cc69f84ee6ac16d9bfb4e05de500"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_decrypt7) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 256 Decrypt message_len=0 ad_len=16 mac_len=16 nonce_len=12 valid 2",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "033360a08d0b2963ce4dcf807b772ac86ae3e8b8fabb9cd3a636f8ec54365646",
    .p_ad                   = "f9d15fc34984b8f4a7caa29a82b24c52",
    .p_nonce                = "8dcaa63d13a2425395609914",
    .p_mac                  = "42bc9cc93a1c8592bd29c9ef9f907780"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_decrypt8) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 256 Decrypt message_len=0 ad_len=16 mac_len=16 nonce_len=12 valid 3",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "4f1a5fc8e4689c493ef8e23a653e86e4d4c8972a2338653375b0f36a4feb91d7",
    .p_ad                   = "f09b0fc4e4ccb5e28dfcc0792a6800f3",
    .p_nonce                = "9b8221a631404088218fe487",
    .p_mac                  = "31073f1a0050462a03c7ad0bbefaf93b"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_decrypt9) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 256 Decrypt message_len=16 ad_len=0 mac_len=16 nonce_len=12 valid 1",
    .p_plaintext            = "7789b41cb3ee548814ca0b388c10b343",
    .p_ciphertext           = "d2c78110ac7e8f107c0df0570bd7c90c",
    .p_key                  = "4c8ebfe1444ec1b2d503c6986659af2c94fafe945f72c1e8486a5acfedb8a0f8",
    .p_ad                   = "",
    .p_nonce                = "473360e0ad24889959858995",
    .p_mac                  = "c26a379b6d98ef2852ead8ce83a833a7"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_decrypt10) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 256 Decrypt message_len=16 ad_len=0 mac_len=16 nonce_len=12 valid 2",
    .p_plaintext            = "697aff2d6b77e5ed6232770e400c1ead",
    .p_ciphertext           = "e0de64302ac2d04048d65a87d2ad09fe",
    .p_key                  = "3934f363fd9f771352c4c7a060682ed03c2864223a1573b3af997e2ababd60ab",
    .p_ad                   = "",
    .p_nonce                = "efe2656d878c586e41c539c4",
    .p_mac                  = "33cbd8d2fb8a3a03e30c1eb1b53c1d99"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_decrypt11) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 256 Decrypt message_len=16 ad_len=0 mac_len=16 nonce_len=12 invalid 1",
    .p_plaintext            = "697aff2d6b77e5ed6232770e400c1ead",
    .p_ciphertext           = "9f6607d68e22ccf21928db0986be126e",
    .p_key                  = "c997768e2d14e3d38259667a6649079de77beb4543589771e5068e6cd7cd0b14",
    .p_ad                   = "",
    .p_nonce                = "835090aed9552dbdd45277e2",
    .p_mac                  = "f32617f67c574fd9f44ef76ff880ab9f"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_decrypt12) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 256 Decrypt message_len=16 ad_len=16 mac_len=16 nonce_len=12 valid 1",
    .p_plaintext            = "85fc3dfad9b5a8d3258e4fc44571bd3b",
    .p_ciphertext           = "426e0efc693b7be1f3018db7ddbb7e4d",
    .p_key                  = "54e352ea1d84bfe64a1011096111fbe7668ad2203d902a01458c3bbd85bfce14",
    .p_ad                   = "7e968d71b50c1f11fd001f3fef49d045",
    .p_nonce                = "df7c3bca00396d0c018495d9",
    .p_mac                  = "ee8257795be6a1164d7e1d2d6cac77a7"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_decrypt13) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 256 Decrypt message_len=16 ad_len=16 mac_len=16 nonce_len=12 valid 2",
    .p_plaintext            = "3fe7811a8224a1881da34a27e03da86a",
    .p_ciphertext           = "c61155d41495e9fc76060fe7f8c926a2",
    .p_key                  = "82f0d1ddc58123f805541f55a7eab43f56ddfefc06c73d57709df3d5a4aabfb3",
    .p_ad                   = "34325620a392739beeee6c370967d539",
    .p_nonce                = "0c9d74af29ed4406c77a8e4b",
    .p_mac                  = "66d8c881d66370504d2bf00cdb06259e"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_decrypt14) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 256 Decrypt message_len=16 ad_len=16 mac_len=16 nonce_len=12 invalid 1",
    .p_plaintext            = "3fe7811a8224a1881da34a27e03da86a",
    .p_ciphertext           = "e93165935ac18e3a2845d15fe31a9286",
    .p_key                  = "9a0343f850a6427120f764789ffec6d237447b898fbf51d2182f065d3861497d",
    .p_ad                   = "dbb8226a624520863db6897017b2a4f8",
    .p_nonce                = "3deef6f453dd70d92143adcd",
    .p_mac                  = "f5fc50d18766bc3d9e16dd136d45816b"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_decrypt15) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 256 Decrypt message_len=16 ad_len=90 mac_len=13 nonce_len=128 invalid 1",
    .p_plaintext            = "3fe7811a8224a1881da34a27e03da86a",
    .p_ciphertext           = "2975341596f99a22f85a48272d089357",
    .p_key                  = "f65818c25506e571ea4778e71b838ab24d3d6a318670885ded4761c2214ae08c",
    .p_ad                   = "f16c6a6a94a09f7936c718ca182f0e2d8b90de8edecec7257354a02539bee9d232c04b25d6fcc081e8852d834b7044cfec8b0073c62fc676b6d062693b99e791ddc6292bee1f5dc39acc18b06bf5c73a64772195b89659b87275",
    .p_nonce                = "f3d6c665c371db5c8d69ab46ac53eabfd4481a337d005bd0204f5838d770a1bb9868082542b43732d371c7786ab5e3fa217176f959ede631e373488c996c03c00496ff468cc9a2a15700e3aef82ae01f598f703e55da6d6cc9cace3c1f2adf6973af9f7f19dd903d7d0670bc082ec0e97c244426910b6c8e85358eaea8a9807b",
    .p_mac                  = "f260536b28c1220940044c3593"
};

