OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_gcm.c
// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_decrypt16) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 256 Decrypt message_len=16 ad_len=90 mac_len=13 nonce_len=128 valid 1",
    .p_plaintext            = "32f7cc94968659f34f23bda8117f065e",
    .p_ciphertext           = "8700601301096fbfe50b413a8059202d",
    .p_key                  = "fb9cf2d324f5ca351b37d960f314d602d33c01b21be3fcbe0e5a3c55eb9f7d74",
    .p_ad                   = "b0b6f49d881e0af5d879219d7acdd8efd7c2561ee5516de0cc32b61d1c8abd9629bfed1bfdd3cb73e3b39d480af6ea7f9c823f55512a8013ac92b6f3b13efe707dd08c4349e6e15bb2fd6ea4cd6de69b8f1b1c290353ea6ec548",
    .p_nonce                = "53571073c7deffe06b42e3a5cd0d0574ff9ba8afb2fa504420d5fbb1fc6c6aec70b412d40e4e0e0c0abccda8830d3aa6dcb14514f1648b13920a1cf0bc0dfc7ef26d9304f8c1a2858c5ae18993120508ead1f6aa1f7f5ed3f470b203045e9d3d97b493c7d6991061d62555c90bdbd46fa5fe40a4e762361c951f05ee3ce4dd1a",
    .p_mac                  = "247b1c2705c6300785ff514d58"
};

// AES GCM - NIST CAVS 14.0 Decrypt with keysize 256 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_gcm_256_decrypt17) =
{
    .p_aead_info            = &g_nrf_crypto_aes_gcm_256_info,
#if NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_MBEDTLS)
    .expected_err_code      = NRF_ERROR_CRYPTO_AEAD_INVALID_MAC,
#else
    .expected_err_code      = NRF_ERROR_CRYPTO_INTERNAL,
#endif
    .crypt_expected_result  = EXPECTED_TO_FAIL,
    .mac_expected_result    = EXPECTED_TO_FAIL,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "GCM 256 Decrypt message_len=16 ad_len=90 mac_len=13 nonce_len=128 invalid 2",
    .p_plaintext            = "32f7cc94968659f34f23bda8117f065e",
    .p_ciphertext           = "5bfb289d9832cc5dffce4d1d33357951",
    .p_key                  = "b21ef6860b889efdc04ee1cbae0e84a4f31ac9369b01caa901e873ee6f970839",
    .p_ad                   = "d721291424b17f9ca4f059f208dd7908cdcfd50681641c8dfca185c89e7f1ecf1761bc32b492d8e5ce9cd873cd18a778595fd9b53878634b285f5383a79e01abf6542abffbf4f67347193740f73c3dbac654398027315280e2d5",
    .p_nonce                = "7657f649159a91a7f953e323c236a62f678dab54dd5ae8381419fbcb0ce3d3ec358d46fba5e4dc67cf4157bc6a8f42bc4b1d8624c0b9501f00146e628cecc6580aff6d1bf59f5667f3005b2636f4333930b07f8e814966fce1740919d1f3befa418a81693c0be066b1d17ede09ef36b35b1d908608aeb7ea77d03eec9936736b",
    .p_mac                  = "8eac04b744d91e7b2c5a6ed792"
};

#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_AES_GCM_256)

/*lint -restore */

#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_AES_GCM)
